[
  {
    "name": "Anthony",
    "image": "https://b2533805.smushcdn.com/2533805/wp-content/uploads/2018/11/Anthony-OBrien-Profici-768x1019.jpg?lossy=2&strip=1&webp=1",
    "position": "Managing Director",
    "about": "Anthony is Managing Director and a growth acceleration expert who works with a wealth of CEOs, executives, and entrepreneurs to help grow their brands through the power of strategising, consultancy and digital marketing. With this, Anthony runs an agency that focuses on providing the upmost support for busines leaders who want to succeed and prosper.\n\nIndeed, Anthony thrives on helping other businesses grow and reach their potential, empowering other likeminded individuals to realise their ambitions. Be it by marketing their business, or providing them with expert consultancy and coaching, not only does Anthony measure success quantitively, but he also measures success by how many entrepreneurs he has empowered and helped whilst watching their businesses grow because of his support.\n\nThis is exemplified by how he grew a £300k business to an £8m multi-national corporation in just 4 years. Anthony did this by empowering his partners, guiding the business through new and prosperous ventures, leading by example, and connecting with other likeminded individuals and companies. It is this aptitude for leadership and business expansion that has seen him have a hand in growing some of the country’s most successful businesses."
  },
  {
    "name": "Lee",
    "image": "https://b2533805.smushcdn.com/2533805/wp-content/uploads/2022/04/Lee-C-Profici-768x1019.jpg?lossy=2&strip=1&webp=1",
    "position": "Technical Director",
    "about": "As Technical Director at Profici, Lee mainly leads a team of digital experts and specialist web developers and monitors the maintenance, design, and improvements of our customers’ websites, but also the practices, standards, systems, and technologies that underpin their business growth.\n\nWith several years of experience in the digital and business growth sector and a strong technical background in IT support and website development, the highlight of Lee’s role is to consult for some of the world’s biggest businesses and make sure they receive a website that is allied with their growth plans."
  },
  {
    "name": "Tom",
    "image": "https://b2533805.smushcdn.com/2533805/wp-content/uploads/2022/04/Tom-New.jpg?lossy=2&strip=1&webp=1",
    "position": "Operations Director",
    "about": "Over the past 10 years Tom has worked across several eclectic markets and sectors, ranging from large market-leading companies to some of the fastest-growing start-ups in the world. Tom is adept at managing both big and limited budgets and handling customer and stakeholder requirements.A PPC and SEO specialist, Tom is a paid advertising authority and heads up our operations team, working across disciplines to deliver an enhanced ROI for our clients. In short, Tom works alongside some of the world’s most renowned businesses and leading CEOs to devise, develop and implement paid marketing strategies that exceed their KPIs."
  },
  {
    "name": "Sandra",
    "image": "https://b2533805.smushcdn.com/2533805/wp-content/uploads/2022/04/Sandra.jpg?lossy=2&strip=1&webp=1",
    "position": "Head of Accounts",
    "about": "Sandra is the glue that keeps our creative team together and is responsible for overseeing not only our accounts, but also those of some of our biggest clients. Sandra is mostly responsible for much of the work nobody sees – work, however, that is vital to the smooth running of the business.An eccentric at heart and with a wealth of experience in the industry, Sandra is an important asset to the team and is perfectly placed to assist with the day-to-day work that goes into running numerous accounts."
  },
  {
    "name": "Ross",
    "image": "https://b2533805.smushcdn.com/2533805/wp-content/uploads/2022/04/ross.jpg?lossy=2&strip=1&webp=1",
    "position": "Head of Graphics",
    "about": "An experienced Graphic Designer with a demonstrated history of working in the marketing, advertising and business growth industry, Ross is an authority when it comes to marketing, graphic design, branding, art direction and social media marketing.Ross work distinguishes itself by being artistic while also providing our clients with an integral growth function. Through working with a diverse range of clients and varied industries, Ross explores functionality, encourages business growth, and expresses unique stories through the visualisation of their design brief."
  },
  {
    "name": "Ash",
    "image": "https://b2533805.smushcdn.com/2533805/wp-content/uploads/2022/07/Ash-New.jpg?lossy=2&strip=1&webp=1",
    "position": "Video Content Creator",
    "about": "Have you ever wished people knew just how great your customer experience was before they worked with you? That's where Ash comes in.He looks after all things video, taking a creative approach to getting your business visualised and explained in the best way possible. Experienced at working with a huge range of different business sectors and budgets he is able to suggest and create the content your business needs and then helps you implement them – In other words, none of this -  Here's your video, see ya later approach to video.After graduating from Bangor University he has worked both in-house roles and freelance before turning his head to work with the Profici team where he helps us not just create great-looking content, but really work out what videos will move the needle for your business, develop content plans and oversee productions."
  }
]
